app/views/groups/show.html.erb

SELECT  1 AS one FROM `friendships` WHERE `friendships`.`user_id` = 7 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 7
---
 <ul>
<% if @group.user.friendships.any? %>

SELECT  1 AS one FROM `group_members` WHERE `group_members`.`group_id` = 26 LIMIT 1
---
  <strong>group members:</strong>
  <% if @group.group_members.any? %>