app/views/users/home.html.erb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 31 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
        <% @invited.each do |event| %>
            <li style="font-size: 15px"><%=  event.order.user.username %> invited you to <%= link_to 'order', order_url(event.order) %> from <%=	 event.order.resturant %><br></li>