app/views/orders/show.html.erb

SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 47
---
 <tbody id="orders">
    <% @order.order_details.each do |o| %>