app/controllers/friendships_controller.rb

INSERT INTO `friendships` (`user_id`, `friend_id`, `created_at`, `updated_at`) VALUES (8, 1, '2018-03-18 21:25:48', '2018-03-18 21:25:48')
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save

SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`id` = 3 LIMIT 1
DELETE FROM `friendships` WHERE `friendships`.`id` = 70
---
  def destroy
    @friendship = Friendship.find(params[:id])
    @friendship.destroy

SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 2 AND `friendships`.`user_id` = 2
---
    def index
         @friendships = current_user.friendships.where( :user_id => current_user.id)

SELECT `users`.* FROM `users`
INSERT INTO `friendships` (`user_id`, `friend_id`, `created_at`, `updated_at`) VALUES (2, 1, '2018-03-18 15:31:23', '2018-03-18 15:31:23')
---
    def add_friend
      for user in User.all
        if params[:friend_email] == user.email && params[:friend_email] != current_user.email
           @friendship = current_user.friendships.build(:friend_id => user.id)
           respond_to do |format|
              if @friendship.save