app/controllers/groups_controller.rb

  def index
    @groups = Group.where(user_id: current_user.id)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 2

  def newGroup
    @group = Group.new(name: params['name'], user_id: current_user.id)
    @group.user_id = current_user.id
    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('ddd', 2, '2018-03-18 15:06:53', '2018-03-18 15:06:53')

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE `groups` SET `name` = 'dede', `updated_at` = '2018-03-20 08:59:32' WHERE `groups`.`id` = 33

  def destroy
    @group.destroy
---
DELETE FROM `groups` WHERE `groups`.`id` = 24

    def set_group
      @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 26 LIMIT 1