app/controllers/group_members_controller.rb

  def index

    @group_members = []
    @group_id = params[:id]
    @members_id = GroupMember.where(group_id: params[:id])
    @members_id.each do |member|
      friends = User.where(id: member.user_id)
---
SELECT `group_members`.* FROM `group_members` WHERE `group_members`.`group_id` = 8
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def delete

      @group_member = GroupMember.find_by(user_id: params[:id], group_id: params[:g])
      if @group_member.destroy
---
SELECT  `group_members`.* FROM `group_members` WHERE `group_members`.`user_id` = 3 AND `group_members`.`group_id` = 8 LIMIT 1
DELETE FROM `group_members` WHERE `group_members`.`id` = 68

  def add

    @addMember = User.find_by username: params[:memberName]
    @friends = current_user.friendships
    @found = 0
    if @addMember
      @friends.each do |friend|
        if @addMember.id == friend.friend_id
          @found = 1
          break
        end
      end
      if @found == 1
        respond_to do |format|
          puts(@addMember)
          @group = Group.find(params[:group_id])
          @group_member = @group.group_members.build(:user_id => @addMember.id,:group_id => params[:group_id] )
          if @group_member.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 's' LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 2
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 8 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `group_members` (`user_id`, `group_id`, `created_at`, `updated_at`) VALUES (3, 8, '2018-03-18 15:07:08', '2018-03-18 15:07:08')