app/controllers/invited_to_orders_controller.rb

  def invite
    @friends = current_user.friendships
    @inputfriend = User.find_by username: params[:friendName]
    @found = 0
    if @inputfriend
      @friends.each do |friend|
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 's' LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 2

def showInvited
        @invited_to_order=InvitedToOrder.where(order_id: params[:order_id])
        @invited_to_orders= []
        @invited_to_order.each do |inv|
        if inv.status == 'invited'
        friend = User.where(id: inv.user_id)
---
SELECT `invited_to_orders`.* FROM `invited_to_orders` WHERE `invited_to_orders`.`order_id` = 75
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 ORDER BY `users`.`id` ASC LIMIT 1

def showJoined
        @invited_to_order=InvitedToOrder.where(order_id: params[:order_id])
        @friends= []
        @invited_to_order.each do |inv|
        if inv.status == 'joined'
        friend = User.where(id: inv.user_id)
---
SELECT `invited_to_orders`.* FROM `invited_to_orders` WHERE `invited_to_orders`.`order_id` = 75
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 ORDER BY `users`.`id` ASC LIMIT 1

  def inviteGroup
    @groups = current_user.groups
    @inputgroup = Group.find_by name: params[:groupName]
    # @inputgroup = Group.where(name: params[:groupName], user_id: current_user.id)

    @found = 0
    if @inputgroup
      @groups.each do |group|
        if @inputgroup.id == group.id
          @found = 1
          break
        end
      end
      if @found == 1
        @members = GroupMember.where(group_id: @inputgroup.id)
        @invitedList = []
        @members.each do |member|
          invited = User.find_by id: member.user_id
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 2
SELECT  `groups`.* FROM `groups` WHERE `groups`.`name` = '2222' LIMIT 1
SELECT `group_members`.* FROM `group_members` WHERE `group_members`.`group_id` = 8
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

  def join
    @invitation = InvitedToOrder.where(id: params[:invite_id])
    if @invitation.update(status: 'joined')
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 31 LIMIT 1
SELECT `invited_to_orders`.* FROM `invited_to_orders` WHERE `invited_to_orders`.`id` IS NULL
UPDATE `invited_to_orders` SET `status` = 'joined', `updated_at` = '2018-03-18 17:35:26' WHERE `invited_to_orders`.`id` = 16