app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2 ORDER BY created_at DESC
---
  def index
    @orders = Order.where(user_id: current_user.id).order("created_at DESC")

SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 2
---
  def new
    @order = Order.new
    @user = current_user
    @friends = []
    @user.friendships.each {|friend|

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `orders` (`resturant`, `image`, `status`, `user_id`, `created_at`, `updated_at`, `meal`) VALUES ('s', '003.jpg', 'waiting', 2, '2018-03-20 16:54:39', '2018-03-20 16:54:39', 's')
INSERT INTO `invited_to_orders` (`order_id`, `user_id`, `status`, `created_at`, `updated_at`) VALUES (48, 1, 'invited', '2018-03-18 19:05:29', '2018-03-18 19:05:29')
---
  def create
    @order = Order.new(order_params)
    @user = User.find_by(id: current_user.id)
    @order.user_id = current_user.id
    friendsList = @@friendsList
    puts(friendsList)
    respond_to do |format|
      if @order.save
        if friendsList
        friendsList.each do |f|
          @invited = InvitedToOrder.new(order_id: @order.id, user_id: f, status: "invited" )
          @invited.save

UPDATE `orders` SET `status` = 'waiting', `meal` = '5555555', `resturant` = '55555555', `updated_at` = '2018-03-20 09:05:49' WHERE `orders`.`id` = 10
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 47 LIMIT 1
UPDATE `orders` SET `status` = 'finished', `updated_at` = '2018-03-18 15:06:44' WHERE `orders`.`id` = 47
---
  def finish
    @finishedOrder = Order.find_by(id: params[:order_id])
    respond_to do |format|
      if @finishedOrder.update(status: "finished")

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 85 LIMIT 1
---
    def set_order
      @order = Order.find(params[:id])