app/controllers/order_details_controller.rb

SELECT  `order_details`.* FROM `order_details` WHERE `order_details`.`id` = 4 LIMIT 1
DELETE FROM `order_details` WHERE `order_details`.`id` = 4
---
  def destroy
 @order_detail = OrderDetail.find(params[:id])
    if @order_detail.destroy

SELECT  `invited_to_orders`.* FROM `invited_to_orders` WHERE `invited_to_orders`.`order_id` = 89 AND `invited_to_orders`.`user_id` = 2 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 48 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `order_details` (`order_id`, `user_id`, `item`, `amount`, `price`, `comment`, `created_at`, `updated_at`) VALUES (52, 2, 'd', 4, 4, 's', '2018-03-18 21:09:32', '2018-03-18 21:09:32')
---
  def create
    @invited = InvitedToOrder.find_by order_id: params[:order_id], user_id: params[:user_id]
    @order = Order.find(params[:order_id])
    # if @order.user_id == current_user.id
    #   @order_detail = @order.order_details.build(:order_id => params[:order_id],:user_id => params[:user_id],:item => params[:item],:amount => params[:amount],:price => params[:price],:comment => params[:comment] )
    #   if @order_detail.save
    #     flash[:notice] = "Added your order."
    #   else
    #     flash[:error] = "Unable to add order."
    #   end
    #   render json: @order_detail
    # end
    # if @invited
      if (@invited && @invited.status == "joined") ||  @order.user_id == current_user.id
          @order_detail = @order.order_details.build(:order_id => params[:order_id],:user_id => params[:user_id],:item => params[:item],:amount => params[:amount],:price => params[:price],:comment => params[:comment] )
          if @order_detail.save