app/controllers/users_controller.rb

UPDATE `users` SET `image` = '1_rhoU71u1CL9IsoSjJcUaMA.jpeg', `updated_at` = '2018-03-18 21:12:26' WHERE `users`.`id` = 2
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2 ORDER BY created_at DESC LIMIT 10
SELECT  `invited_to_orders`.* FROM `invited_to_orders` WHERE `invited_to_orders`.`user_id` = 2 ORDER BY created_at DESC LIMIT 10
---
  def home
    @user = current_user
    # @group = @user.groups.build
    # @groups = @user.groups
    @orders = Order.where(user_id: @user.id).order("created_at").last(10).reverse

    # Friends Activities
    @invited = InvitedToOrder.where(user_id: @user.id).order("created_at").last(10).reverse

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 ORDER BY `users`.`id` ASC LIMIT 1
---
    def set_user
      @user = User.find(params[:id])